#include "global.h"

int RefreshHelp()
{
   if (DoRefresh == 0) return 0;

   if (StageScr == 2)
   {  Gotoxy(2, 10); Attr(7, 0);
      uprintf(
"Клавиши управления для списка пользователей\n"
"\n"
"   Ctrl-L - перепечатать экран (убрать мусор)\n"
"\n"
"   Стрелки, PgUp, PgDn, Home, End - перемещение по списку \n"
"\n"
"   F1  - этот экран помощи\n"
"\n"
"   F2  - сортировать список по имени\n"
"   F3  - сортировать список по IP-адресу\n"
"   F4  - сортировать список по свичу/порту\n"
"   F5  - обратный порядок\n"
"\n"
"   F9  - (пере-)логиниться под другим пользователем\n"
//"\n"
"   F10 - завершить работу программы\n"
"\n"
"         (для помощи по другим экранам, нажмите F1 там)\n"
"\n"
"   для возврата в предыдущий экран нажмите F10 или Esc.\n"
"              Esc срабатывает с задержкой !\n"
);
   }

   if (StageScr == 3)
   {  Gotoxy(2, 10); Attr(7, 0);
      uprintf(
"Клавиши управления для состояния пользователя\n"
"\n"
"   Ctrl-L - перепечатать экран (убрать мусор)\n"
"\n"
"   F1  - этот экран помощи\n"
"\n"
"   F2  - проплата по Интернету\n"
"   F3  - проплате по Сети\n"
"\n"
"   F10 и Esc - вернутся к списку пользователей\n"
"\n"
"   для возврата в предыдущий экран нажмите F10 или Esc.\n"
"               Esc срабатывает с задержкой !\n"
"\n"
);
   }

   return 0;
}
