// File shell
// Menu source file

#include <global.h>

//
// Этот файл попал в репозиторий по недоразумению, обдумываю, не задействовать
// ли его для чего-то связаного с названием ... например для диалогов
// конфигурации ...
// В данный момент, все связанное с pull-down меню находится в menubar.cc
// 

// Ну если ты не хочешь его держать в репозитории то удали его
// а потом скажи cvs remove menu.cc и cvs commit
// Хотя ты и сам знаешь
// кстати на http://www.openbsd.ru/ есть ссылка не UNIX ресурсы
// и среди них находится ссылка на CVS там мощнейший перевод
// доки по CVS
